app/Http/Controllers/Auth/AuthenticatedSessionController.php

select * from `users` where `email` = 'fatima.bello@gondal.local' limit 1
select * from `users` where `id` = 2 limit 1
---
    public function store(LoginRequest $request)
    {

        $user = User::where('email',$request->email)->first();
        if($user != null)
        {
            $companyUser = User::where('id' , $user->created_by)->first();

select * from `users` where `users`.`id` = 2 limit 1
---
        $request->session()->regenerate();
        $user = Auth::user();

        $companyUser = User::find($user->created_by);

select * from `plans` where `plans`.`id` = 1 limit 1
---
        $user = \Auth::user();
        if(isset($user->type) && $user->type == 'company')
        {
            $plan = Plan::find($user->plan);

update `users` set `last_login_at` = '2026-03-28 14:01:57', `users`.`updated_at` = '2026-03-28 14:01:57' where `id` = 11
---
        date_default_timezone_set($timezone);

        // Update Last Login Time
        $user->update(
            [
                'last_login_at' => Carbon::now()->toDateTimeString(),
            ]
        );

insert into `login_details` (`user_id`, `ip`, `date`, `Details`, `created_by`, `updated_at`, `created_at`) values (11, '127.0.0.1', '2026-03-28 14:01:58', '{\"status\":\"fail\",\"message\":\"reserved range\",\"query\":\"127.0.0.1\",\"browser_name\":\"Safari\",\"os_name\":\"OS X\",\"browser_language\":\"en\",\"device_type\":\"desktop\",\"referrer_host\":true,\"referrer_path\":true}', 2, '2026-03-28 14:01:58', '2026-03-28 14:01:58')
---
            $login_detail->date = date('Y-m-d H:i:s');
            $login_detail->Details = $json;
            $login_detail->created_by = \Auth::user()->creatorId();
            $login_detail->save();