app/Http/Controllers/Gondal/GondalController.php

    public function standardDashboard(Request $request)
    {
        $this->requireAnyPermission(GondalPermissionRegistry::dashboardAccessAbilities());

        $collections = MilkCollection::query()
            ->with('farmer.cooperative')
            ->orderByDesc('collection_date')
            ->get();

        $latestCollectionDate = optional($collections->first()?->collection_date)->copy() ?: now();
        $trendStart = $latestCollectionDate->copy()->subDays(6)->startOfDay();
        $trend = collect(range(0, 6))->map(function (int $offset) use ($trendStart, $collections) {
            $date = $trendStart->copy()->addDays($offset)->toDateString();
            $liters = (float) $collections->filter(fn (MilkCollection $collection) => optional($collection->collection_date)->toDateString() === $date)->sum('quantity');

            return [
                'date' => $date,
                'label' => Carbon::parse($date)->format('M j'),
                'liters' => round($liters, 2),
            ];
        });

        $farmerQuery = Vender::query()->with('cooperative');
        $cooperatives = Cooperative::query()->withCount('farmers')->orderBy('name')->get();
        $requisitions = Requisition::query()->with('requester')->latest()->take(5)->get();
        $paymentBatches = PaymentBatch::query()->latest('period_end')->take(5)->get();

        $genderLookup = (clone $farmerQuery)->get()
            ->groupBy(fn (Vender $farmer) => Str::lower((string) $farmer->gender))
            ->map->count();
---
select * from `cooperatives` where `cooperatives`.`id` in (1)
select * from `milk_collections` order by `collection_date` desc
select * from `gondal_payment_batches` order by `period_end` desc limit 5
select count(*) as aggregate from `venders`
select * from `venders`

            ];
        })->sortByDesc('liters')->values();

        $paymentEnabledFarmers = Vender::query()
            ->where(function ($query) {
                $query->where('digital_payment_enabled', 1)
                    ->orWhereNotNull('bank_name')
                    ->orWhereNotNull('account_number');
            })
            ->count();
---
select count(*) as aggregate from `venders` where (`digital_payment_enabled` = 1 or `bank_name` is not null or `account_number` is not null)

            return $farmer->created_at && $farmer->created_at->month === now()->month && $farmer->created_at->year === now()->year;
        })->count();

        $paymentEnabledThisMonth = Vender::query()
            ->where(function ($query) {
                $query->where('digital_payment_enabled', 1)
                    ->orWhereNotNull('bank_name')
                    ->orWhereNotNull('account_number');
            })
            ->whereMonth('updated_at', now()->month)
            ->whereYear('updated_at', now()->year)
            ->count();

        $coopThisMonth = Cooperative::query()
            ->whereMonth('created_at', now()->month)
            ->whereYear('created_at', now()->year)
            ->count();
---
select count(*) as aggregate from `venders` where (`digital_payment_enabled` = 1 or `bank_name` is not null or `account_number` is not null) and month(`updated_at`) = '03' and year(`updated_at`) = 2026
select count(*) as aggregate from `cooperatives` where month(`created_at`) = '03' and year(`created_at`) = 2026

        $teamActivities = LoginDetail::query()
            ->join('users', 'users.id', '=', 'login_details.user_id')
            ->where(function ($query) use ($creatorId) {
                $query->where('users.id', $creatorId)
                    ->orWhere('users.created_by', $creatorId);
            })
            ->whereNotIn('users.type', ['client'])
            ->orderByDesc('login_details.created_at')
            ->limit(6)
            ->get([
                'login_details.id',
                'login_details.ip',
                'login_details.date',
                'login_details.Details',
                'users.name',
                'users.type',
            ])
            ->map(function ($entry) {
---
select `login_details`.`id`, `login_details`.`ip`, `login_details`.`date`, `login_details`.`Details`, `users`.`name`, `users`.`type` from `login_details` inner join `users` on `users`.`id` = `login_details`.`user_id` where (`users`.`id` = 2 or `users`.`created_by` = 2) and `users`.`type` not in ('client') order by `login_details`.`created_at` desc limit 6

    public function logistics(Request $request)
    {
        $tab = $this->resolveModuleTab($request, 'logistics', 'trips');

        $tripQuery = LogisticsTrip::query()->with(['rider', 'cooperative']);

        if ($status = (string) $request->query('status', '')) {
            $tripQuery->where('status', $status);
        }
        if ($from = $request->query('from')) {
            $tripQuery->whereDate('trip_date', '>=', $from);
        }
        if ($to = $request->query('to')) {
            $tripQuery->whereDate('trip_date', '<=', $to);
        }

        $trips = $tripQuery->orderByDesc('trip_date')->take(50)->get();
        $riders = LogisticsRider::query()->with('trips.cooperative')->orderBy('name')->get();

        return view('gondal.logistics', [
            'tab' => $tab,
            'visibleTabs' => $this->visibleModuleTabs($request, 'logistics'),
            'selectedStatus' => (string) $request->query('status', ''),
            'from' => (string) $request->query('from', ''),
            'to' => (string) $request->query('to', ''),
            'cards' => [
                ['label' => 'Volume Moved', 'value' => number_format((float) LogisticsTrip::query()->sum('volume_liters'), 2).' L'],
                ['label' => 'Active Riders', 'value' => number_format((int) LogisticsRider::query()->where('status', 'active')->count())],
                ['label' => 'Completed Trips', 'value' => number_format((int) LogisticsTrip::query()->where('status', 'completed')->count())],
                ['label' => 'In Transit', 'value' => number_format((int) LogisticsTrip::query()->where('status', 'in_transit')->count())],
            ],
            'trips' => $trips,
            'riders' => $riders,
            'cooperatives' => Cooperative::query()->orderBy('name')->get(),
---
select * from `gondal_logistics_trips` order by `trip_date` desc limit 50
select * from `gondal_logistics_riders` order by `name` asc
select count(*) as aggregate from `gondal_logistics_riders` where `status` = 'active'
select count(*) as aggregate from `gondal_logistics_trips` where `status` = 'completed'
select count(*) as aggregate from `gondal_logistics_trips` where `status` = 'in_transit'
select * from `cooperatives` order by `name` asc

    public function operations(Request $request)
    {
        $tab = $this->resolveModuleTab($request, 'operations', 'costs');

        $query = OperationCost::query()->with('cooperative');

        if ($from = $request->query('from')) {
            $query->whereDate('cost_date', '>=', $from);
        }
        if ($to = $request->query('to')) {
            $query->whereDate('cost_date', '<=', $to);
        }
        if ($category = (string) $request->query('category', '')) {
            $query->where('category', $category);
        }

        $costs = $query->orderByDesc('cost_date')->take(50)->get();
        $allCosts = OperationCost::query()->with('cooperative')->get();

        $weeklySummary = $allCosts->groupBy(fn (OperationCost $cost) => Carbon::parse($cost->cost_date)->startOfWeek()->toDateString())
            ->map(function (Collection $group, string $weekStart) {
                return [
                    'week' => Carbon::parse($weekStart)->format('M j').' - '.Carbon::parse($weekStart)->endOfWeek()->format('M j'),
                    'entries' => $group->count(),
                    'total' => round((float) $group->sum('amount'), 2),
                    'average' => round((float) $group->avg('amount'), 2),
                    'top_category' => (string) $group->groupBy('category')->sortByDesc(fn (Collection $items) => $items->sum('amount'))->keys()->first(),
                ];
            })->values();

        $centerRanking = $allCosts->groupBy(fn (OperationCost $cost) => $cost->cooperative?->name ?: 'Unassigned')
            ->map(fn (Collection $group, string $name) => [
                'name' => $name,
                'entries' => $group->count(),
                'total' => round((float) $group->sum('amount'), 2),
                'average' => round((float) $group->avg('amount'), 2),
            ])->sortByDesc('total')->values();
---
select * from `cooperatives` order by `name` asc

            ->orderByDesc('issued_on')
            ->orderByDesc('id')
            ->get();
        $remittances = AgentRemittance::query()
            ->with(['agentProfile.user', 'agentProfile.vender', 'receiver'])
            ->orderByDesc('remitted_at')
            ->get();
        $reconciliations = InventoryReconciliation::query()
            ->with(['agentProfile.user', 'agentProfile.vender', 'item', 'submitter', 'reviewer'])
            ->orderByDesc('period_end')
            ->orderByDesc('id')
            ->get();
        $todayStart = now()->startOfDay();
        $todayEnd = now()->endOfDay();

        $farmerCredits = Vender::query()
            ->whereHas('inventoryCredits', function($q) {
                $q->whereIn('status', ['open', 'partial']);
            })
            ->withSum(['inventoryCredits as total_owed' => function($q) {
                $q->whereIn('status', ['open', 'partial']);
            }], 'amount')
            ->get()->map(function($vender) {
                $vender->last_credit_date = InventoryCredit::where('vender_id', $vender->id)->max('credit_date');
                return $vender;
            });

        $internalUsers = User::query()
            ->where(function ($query) use ($creatorId) {
                $query->where('id', $creatorId)
                    ->orWhere('created_by', $creatorId);
            })
            ->whereNotIn('type', ['client', 'company', 'super admin'])
            ->orderBy('name')
            ->get();
        $supervisors = $internalUsers;
        $farmers = Vender::query()->orderBy('name')->get();
        $creditExposureByAgent = InventoryCredit::query()
            ->selectRaw('agent_profile_id, COALESCE(SUM(CASE WHEN outstanding_amount > 0 THEN outstanding_amount ELSE amount END), 0) as balance')
            ->whereNotNull('agent_profile_id')
            ->whereIn('status', ['open', 'partial'])
            ->groupBy('agent_profile_id')
            ->pluck('balance', 'agent_profile_id');
---
select * from `gondal_agent_profiles` where `gondal_agent_profiles`.`id` in (1)
select * from `gondal_agent_remittances` order by `remitted_at` desc
select * from `users` where `users`.`id` in (2)
select * from `venders` where `venders`.`id` in (1)
select * from `gondal_inventory_reconciliations` order by `period_end` desc, `id` desc
select `venders`.*, (select sum(`gondal_inventory_credits`.`amount`) from `gondal_inventory_credits` where `venders`.`id` = `gondal_inventory_credits`.`vender_id` and `status` in ('open', 'partial')) as `total_owed` from `venders` where exists (select * from `gondal_inventory_credits` where `venders`.`id` = `gondal_inventory_credits`.`vender_id` and `status` in ('open', 'partial'))
select * from `users` where (`id` = 2 or `created_by` = 2) and `type` not in ('client', 'company', 'super admin') order by `name` asc
select * from `venders` order by `name` asc
select agent_profile_id, COALESCE(SUM(CASE WHEN outstanding_amount > 0 THEN outstanding_amount ELSE amount END), 0) as balance from `gondal_inventory_credits` where `agent_profile_id` is not null and `status` in ('open', 'partial') group by `agent_profile_id`

    public function storeInventorySale(Request $request): RedirectResponse
    {
        $this->requireModulePermission($request, 'inventory', 'sales', 'create');

        $payload = $request->validate([
            'inventory_item_id' => ['required', 'exists:gondal_inventory_items,id'],
            'agent_profile_id' => ['nullable', 'exists:gondal_agent_profiles,id'],
            'vender_id' => ['nullable', 'exists:venders,id'],
            'quantity' => ['required', 'numeric', 'min:0.01'],
            'unit_price' => ['required', 'numeric', 'min:0'],
            'payment_method' => ['required', 'in:Cash,Credit,Transfer'],
            'sold_on' => ['required', 'date'],
            'customer_name' => ['nullable', 'string', 'max:255'],
            'due_date' => ['nullable', 'date', 'after_or_equal:sold_on'],
        ]);

        if ($payload['vender_id'] ?? null) {
            $vender = Vender::query()->find($payload['vender_id']);
            $payload['customer_name'] = $vender ? $vender->name : $payload['customer_name'];
        }

        $item = InventoryItem::query()->findOrFail($payload['inventory_item_id']);
        $agentProfile = ! empty($payload['agent_profile_id'])
            ? AgentProfile::query()->findOrFail($payload['agent_profile_id'])
---
select * from `gondal_inventory_items` where `gondal_inventory_items`.`id` = '2' limit 1
select * from `gondal_agent_profiles` where `gondal_agent_profiles`.`id` = '1' limit 1

            }
        }

        $sale = InventorySale::query()->create([
            'inventory_item_id' => $payload['inventory_item_id'],
            'agent_profile_id' => $payload['agent_profile_id'] ?? null,
            'vender_id' => $payload['vender_id'] ?? null,
            'quantity' => $payload['quantity'],
            'unit_price' => $payload['unit_price'],
            'total_amount' => $totalAmount,
            'payment_method' => $payload['payment_method'],
            'credit_allowed_snapshot' => $agentProfile?->credit_sales_enabled ?? false,
            'sold_on' => $payload['sold_on'],
            'customer_name' => $payload['customer_name'] ?? null,
        ]);
---
insert into `gondal_inventory_sales` (`inventory_item_id`, `agent_profile_id`, `vender_id`, `quantity`, `unit_price`, `total_amount`, `payment_method`, `credit_allowed_snapshot`, `sold_on`, `customer_name`, `updated_at`, `created_at`) values ('2', '1', '', '2', '2500', 5000, 'Cash', 0, '2026-03-28 00:00:00', 'Aisha Aliyu', '2026-03-28 17:05:00', '2026-03-28 17:05:00')

    public function warehouse(Request $request)
    {
        $tab = $this->resolveModuleTab($request, 'warehouse-ops', 'registry');
        $creatorId = $request->user()->creatorId();

        $warehouses = Warehouse::query()
            ->where('created_by', $creatorId)
            ->orderBy('name')
            ->get();
        $warehouseStocks = WarehouseStock::query()
            ->with(['warehouse', 'item'])
            ->whereIn('warehouse_id', $warehouses->pluck('id'))
            ->orderBy('warehouse_id')
            ->orderByDesc('quantity')
            ->get();
        $dispatches = StockIssue::query()
            ->with(['warehouse', 'item', 'agentProfile.user', 'agentProfile.vender', 'issuer'])
            ->whereNotNull('warehouse_id')
            ->whereHas('warehouse', fn ($query) => $query->where('created_by', $creatorId))
            ->orderByDesc('issued_on')
            ->orderByDesc('id')
            ->get();
        $dispatchesForAllocation = $dispatches
            ->sortBy(fn (StockIssue $issue) => sprintf(
                '%s-%010d',
                optional($issue->issued_on)->toDateString() ?: '9999-12-31',
                $issue->id
            ))
            ->values();
        $salesByAgentItem = InventorySale::query()
            ->selectRaw('agent_profile_id, inventory_item_id, COALESCE(SUM(quantity), 0) as quantity')
            ->whereNotNull('agent_profile_id')
            ->groupBy('agent_profile_id', 'inventory_item_id')
            ->get()
            ->mapWithKeys(fn ($row) => [
                $row->agent_profile_id.'|'.$row->inventory_item_id => (float) $row->quantity,
            ]);
        $reconciledSalesByAgentItem = InventoryReconciliation::query()
            ->selectRaw('agent_profile_id, inventory_item_id, COALESCE(SUM(sold_stock_qty), 0) as quantity')
            ->whereIn('status', ['approved', 'approved_with_variance', 'closed'])
            ->groupBy('agent_profile_id', 'inventory_item_id')
            ->get()
            ->mapWithKeys(fn ($row) => [
                $row->agent_profile_id.'|'.$row->inventory_item_id => (float) $row->quantity,
            ]);
---
select * from `gondal_warehouse_stocks` where `warehouse_id` in (1) order by `warehouse_id` asc, `quantity` desc
select * from `gondal_agent_profiles` where `gondal_agent_profiles`.`id` in (1)
select * from `gondal_stock_issues` where `warehouse_id` is not null and exists (select * from `warehouses` where `gondal_stock_issues`.`warehouse_id` = `warehouses`.`id` and `created_by` = 2) order by `issued_on` desc, `id` desc
select * from `users` where `users`.`id` in (2)
select * from `venders` where `venders`.`id` in (1)
select * from `gondal_inventory_items` where `gondal_inventory_items`.`id` in (1)
select agent_profile_id, inventory_item_id, COALESCE(SUM(quantity), 0) as quantity from `gondal_inventory_sales` where `agent_profile_id` is not null group by `agent_profile_id`, `inventory_item_id`
select agent_profile_id, inventory_item_id, COALESCE(SUM(sold_stock_qty), 0) as quantity from `gondal_inventory_reconciliations` where `status` in ('approved', 'approved_with_variance', 'closed') group by `agent_profile_id`, `inventory_item_id`

            'dispatches' => $dispatches,
            'outsideStockRows' => $outsideStockRows,
            'outsideSummaryCards' => $outsideSummaryCards,
            'items' => InventoryItem::query()->orderBy('name')->get(),
            'agents' => AgentProfile::query()->with(['user', 'vender'])->orderBy('agent_code')->get(),
---
select * from `gondal_inventory_items` order by `name` asc
select * from `gondal_agent_profiles` order by `agent_code` asc
select * from `venders` where `venders`.`id` in (1)

    public function storeWarehouseStock(Request $request): RedirectResponse
    {
        $this->requireModulePermission($request, 'warehouse-ops', 'stock', 'create');

        $payload = $request->validate([
            'warehouse_id' => ['required', 'exists:warehouses,id'],
            'inventory_item_id' => ['required', 'exists:gondal_inventory_items,id'],
            'quantity' => ['required', 'numeric', 'min:0.01'],
            'reorder_level' => ['nullable', 'numeric', 'min:0'],
        ]);

        $warehouseStock = WarehouseStock::query()->firstOrNew([
            'warehouse_id' => $payload['warehouse_id'],
            'inventory_item_id' => $payload['inventory_item_id'],
        ]);
        $warehouseStock->created_by = $request->user()->creatorId();
        $warehouseStock->reorder_level = $payload['reorder_level'] ?? $warehouseStock->reorder_level ?? 0;
        $warehouseStock->quantity = (float) ($warehouseStock->quantity ?? 0) + (float) $payload['quantity'];
        $warehouseStock->save();

        $item = InventoryItem::query()->findOrFail($payload['inventory_item_id']);
        $item->update([
            'stock_qty' => (float) $item->stock_qty + (float) $payload['quantity'],
        ]);
---
select * from `gondal_warehouse_stocks` where (`warehouse_id` = '1' and `inventory_item_id` = '2') limit 1
insert into `gondal_warehouse_stocks` (`warehouse_id`, `inventory_item_id`, `created_by`, `reorder_level`, `quantity`, `updated_at`, `created_at`) values ('1', '2', 2, '100', 20000, '2026-03-28 16:59:05', '2026-03-28 16:59:05')
select * from `gondal_inventory_items` where `gondal_inventory_items`.`id` = '2' limit 1
update `gondal_inventory_items` set `stock_qty` = 40000, `gondal_inventory_items`.`updated_at` = '2026-03-28 16:59:05' where `id` = 2

    public function extension(Request $request)
    {
        $tab = $this->resolveModuleTab($request, 'extension', 'agents');

        $visits = ExtensionVisit::query()->with('farmer')->orderByDesc('visit_date')->get();
        $trainings = ExtensionTraining::query()->orderByDesc('training_date')->get();
---
select * from `gondal_extension_visits` order by `visit_date` desc
select * from `gondal_extension_trainings` order by `training_date` desc

            'visits' => $visits,
            'trainings' => $trainings,
            'performanceRows' => $performanceRows,
            'farmers' => Vender::query()->orderBy('name')->get(),
---
select * from `venders` order by `name` asc

    protected function writeAuditLog(Request $request, string $module, string $action, array $context = []): void
    {
        AuditLog::query()->create([
            'user_id' => $request->user()?->id,
            'module' => $module,
            'action' => $action,
            'context' => $context,
        ]);
---
insert into `gondal_audit_logs` (`user_id`, `module`, `action`, `context`, `updated_at`, `created_at`) values (2, 'warehouse-ops', 'warehouse_stock_added', '{\"warehouse_id\":\"1\",\"inventory_item_id\":\"2\",\"quantity\":\"20000\"}', '2026-03-28 16:59:05', '2026-03-28 16:59:05')