app/Http/Controllers/Gondal/GondalController.php

insert into `gondal_logistics_riders` (`name`, `code`, `phone`, `photo_path`, `bank_name`, `account_number`, `account_name`, `bike_make`, `bike_model`, `bike_plate_number`, `identification_type`, `identification_number`, `identification_document_path`, `status`, `updated_at`, `created_at`) values ('Malam Kabir', 'RID-001', '080238489893', 'uploads/gondal/riders/photo_de43c2a3-edbc-4a96-b6c7-6e2db928f0f9.png', 'GT Bank', '22883939834', 'Kabir Musa', 'Salti', 'dalti', '29-ks-12', 'NIN', '7299903993', 'uploads/gondal/riders/identification_a0d266b8-df6a-40d9-9ba5-8f7785156ff5.png', 'active', '2026-03-29 10:23:13', '2026-03-29 10:23:13')
select max(`id`) as aggregate from `gondal_logistics_riders`
---
    public function storeLogisticsRider(Request $request): RedirectResponse
    {
        $this->requireModulePermission($request, 'logistics', 'riders', 'create');

        $payload = $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'phone' => ['nullable', 'string', 'max:50'],
            'photo' => ['nullable', 'image', 'max:4096'],
            'bank_name' => ['nullable', 'string', 'max:255'],
            'account_number' => ['nullable', 'string', 'max:50'],
            'account_name' => ['nullable', 'string', 'max:255'],
            'bike_make' => ['nullable', 'string', 'max:255'],
            'bike_model' => ['nullable', 'string', 'max:255'],
            'bike_plate_number' => ['nullable', 'string', 'max:100'],
            'identification_type' => ['nullable', 'string', 'max:255'],
            'identification_number' => ['nullable', 'string', 'max:100'],
            'identification_document' => ['nullable', 'file', 'mimes:jpg,jpeg,png,pdf', 'max:5120'],
            'status' => ['required', 'in:active,inactive'],
        ]);

        $rider = LogisticsRider::query()->create([
            'name' => $payload['name'],
            'code' => 'RID-'.str_pad((string) ((int) LogisticsRider::query()->max('id') + 1), 3, '0', STR_PAD_LEFT),
            'phone' => $payload['phone'] ?: null,
            'photo_path' => $this->storeRiderAsset($request->file('photo'), 'photo'),
            'bank_name' => $payload['bank_name'] ?: null,
            'account_number' => $payload['account_number'] ?: null,
            'account_name' => $payload['account_name'] ?: null,
            'bike_make' => $payload['bike_make'] ?: null,
            'bike_model' => $payload['bike_model'] ?: null,
            'bike_plate_number' => $payload['bike_plate_number'] ?: null,
            'identification_type' => $payload['identification_type'] ?: null,
            'identification_number' => $payload['identification_number'] ?: null,
            'identification_document_path' => $this->storeRiderAsset($request->file('identification_document'), 'identification'),
            'status' => $payload['status'],
        ]);

select * from `cooperatives` order by `name` asc
---
    public function requisitions(Request $request)
    {
        $this->requireModuleAccess($request, 'requisitions');

        $tab = in_array((string) $request->query('tab', 'all'), ['all', 'pending', 'approved', 'rejected'], true)
            ? (string) $request->query('tab', 'all')
            : 'all';

        $query = Requisition::query()->with(['requester', 'cooperative', 'items', 'events.actor'])->latest();

        if ($tab !== 'all') {
            $query->where('status', $tab);
        }

        $requisitions = $query->get();

        return view('gondal.requisitions', [
            'tab' => $tab,
            'statusTabs' => GondalPermissionRegistry::pageTabs('requisitions'),
            'requisitions' => $requisitions,
            'cooperatives' => Cooperative::query()->orderBy('name')->get(),

select * from `venders` where `venders`.`id` in (1)
select * from `gondal_inventory_items` where `gondal_inventory_items`.`id` in (2)
---
    public function storeInventorySale(Request $request): RedirectResponse
    {
        $this->requireModulePermission($request, 'inventory', 'sales', 'create');

        $payload = $request->validate([
            'inventory_item_id' => ['required', 'exists:gondal_inventory_items,id'],
            'agent_profile_id' => ['nullable', 'exists:gondal_agent_profiles,id'],
            'vender_id' => ['nullable', 'exists:venders,id'],
            'quantity' => ['required', 'numeric', 'min:0.01'],
            'unit_price' => ['required', 'numeric', 'min:0'],
            'payment_method' => ['required', 'in:Cash,Credit,Transfer'],
            'sold_on' => ['required', 'date'],
            'customer_name' => ['nullable', 'string', 'max:255'],
            'due_date' => ['nullable', 'date', 'after_or_equal:sold_on'],
        ]);

        if ($payload['vender_id'] ?? null) {
            $vender = Vender::query()->find($payload['vender_id']);
            $payload['customer_name'] = $vender ? $vender->name : $payload['customer_name'];
        }

        $item = InventoryItem::query()->findOrFail($payload['inventory_item_id']);