app/Http/Controllers/Gondal/GondalController.php

select * from `cooperatives` where `cooperatives`.`id` in (1)
select * from `venders`
---
    public function standardDashboard(Request $request)
    {
        $this->requireAnyPermission(GondalPermissionRegistry::dashboardAccessAbilities());

        $collections = MilkCollection::query()
            ->with('farmer.cooperative')
            ->orderByDesc('collection_date')
            ->get();

        $latestCollectionDate = optional($collections->first()?->collection_date)->copy() ?: now();
        $trendStart = $latestCollectionDate->copy()->subDays(6)->startOfDay();
        $trend = collect(range(0, 6))->map(function (int $offset) use ($trendStart, $collections) {
            $date = $trendStart->copy()->addDays($offset)->toDateString();
            $liters = (float) $collections->filter(fn (MilkCollection $collection) => optional($collection->collection_date)->toDateString() === $date)->sum('quantity');

            return [
                'date' => $date,
                'label' => Carbon::parse($date)->format('M j'),
                'liters' => round($liters, 2),
            ];
        });

        $farmerQuery = Vender::query()->with('cooperative');
        $cooperatives = Cooperative::query()->withCount('farmers')->orderBy('name')->get();
        $requisitions = Requisition::query()->with('requester')->latest()->take(5)->get();
        $paymentBatches = PaymentBatch::query()->latest('period_end')->take(5)->get();

        $genderLookup = (clone $farmerQuery)->get()
            ->groupBy(fn (Vender $farmer) => Str::lower((string) $farmer->gender))
            ->map->count();

select count(*) as aggregate from `cooperatives` where month(`created_at`) = '03' and year(`created_at`) = 2026
---
        $centerSummaries = $cooperatives->map(function (Cooperative $cooperative) use ($collections) {
            $coopCollections = $this->collectionsForCooperative($collections, $cooperative);

            return [
                'name' => $cooperative->name,
                'mcc' => $cooperative->location ?: 'N/A',
                'members' => (int) $cooperative->farmers_count,
                'liters' => round((float) $coopCollections->sum('quantity'), 2),
            ];
        })->sortByDesc('liters')->values();

select * from `cooperatives` where `cooperatives`.`id` in (1)
select * from `milk_collection_centers` where `milk_collection_centers`.`id` in (2, 3)
select * from `milk_collections` where `status` = 'validated' order by `collection_date` desc limit 50
select * from `milk_collection_centers` where `milk_collection_centers`.`id` in (2)
select * from `milk_collections` where date(`collection_date`) = '2026-04-06'
---
    public function milkCollection(Request $request)
    {
        $selectedDate = Carbon::parse((string) $request->query('date', now()->toDateString()))->toDateString();
        $view = in_array((string) $request->query('view', 'records'), ['records', 'summary'], true)
            ? (string) $request->query('view', 'records')
            : 'records';
        $tab = in_array((string) $request->query('tab', 'all'), ['all', 'pending', 'validated', 'rejected'], true)
            ? (string) $request->query('tab', 'all')
            : 'all';

        $recordsQuery = MilkCollection::query()->with(['farmer.cooperative', 'qualityTest', 'collectionCenter']);
        $this->programScopeService->scopedMilkCollectionsQuery($recordsQuery, $request->user());

        if ($from = $request->query('from')) {
            $recordsQuery->whereDate('collection_date', '>=', $from);
        }
        if ($to = $request->query('to')) {
            $recordsQuery->whereDate('collection_date', '<=', $to);
        }
        if ($grade = $request->query('grade')) {
            $recordsQuery->where('quality_grade', strtoupper((string) $grade));
        }

        if ($tab !== 'all') {
            $recordsQuery->where('status', $tab);
        }

        $records = $recordsQuery->orderByDesc('collection_date')->take(50)->get();
        $dayCollectionsQuery = MilkCollection::query()->with(['farmer.cooperative', 'qualityTest', 'collectionCenter'])->whereDate('collection_date', $selectedDate);
        $this->programScopeService->scopedMilkCollectionsQuery($dayCollectionsQuery, $request->user());
        $dayCollections = $dayCollectionsQuery->get();

select * from `milk_collection_centers` where `milk_collection_centers`.`id` in (2)
---
                'accepted_value' => round((float) $rows->sum('accepted_value'), 2),
            ]);

        $summaryRows = Cooperative::query()->withCount('farmers')->orderBy('name')->get()->map(function (Cooperative $cooperative) use ($dailyReconciliations, $dayCollections) {
            $rows = $this->collectionsForCooperative($dayCollections, $cooperative);
            $count = max(1, $rows->count());
            $reconciliation = $rows->first()?->milk_collection_center_id
                ? $dailyReconciliations->get((int) $rows->first()->milk_collection_center_id)
                : null;

            return [
                'name' => $cooperative->name,
                'mcc' => $cooperative->location ?: 'N/A',
                'farmers_count' => $rows->pluck('farmer_id')->filter()->unique()->count(),
                'liters' => round((float) $rows->sum('quantity'), 2),
                'avg_fat_percent' => round((float) $rows->avg('fat_percentage'), 2),
                'grade_a_count' => $rows->filter(fn (MilkCollection $collection) => strtoupper((string) $collection->quality_grade) === 'A')->count(),
                'total_records' => $count === 1 && $rows->isEmpty() ? 0 : $count,
                'accepted_collections' => (int) ($reconciliation['accepted_collections'] ?? $rows->filter(fn (MilkCollection $collection) => strtoupper((string) $collection->quality_grade) !== 'C')->count()),
                'rejected_collections' => (int) ($reconciliation['rejected_collections'] ?? $rows->filter(fn (MilkCollection $collection) => strtoupper((string) $collection->quality_grade) === 'C')->count()),
                'accepted_value' => round((float) ($reconciliation['accepted_value'] ?? 0), 2),
            ];
        });

select * from `venders` order by `name` asc
---
            'to' => (string) $request->query('to', ''),
            'summaryRows' => $summaryRows,
            'records' => $records,
            'farmers' => $this->programScopeService->scopedFarmersQuery(Vender::query(), $request->user())->orderBy('name')->get(),

select * from `milk_collections` where `milk_collections`.`id` = '197' limit 1
---
    public function validateMilkCollection(Request $request, string $id): RedirectResponse
    {
        $collection = MilkCollection::query()->findOrFail($id);

select * from `gondal_payment_batches` order by `period_end` desc
select * from `gondal_settlement_runs` order by `period_end` desc limit 25
select * from `gondal_inventory_credits` order by `credit_date` desc
select * from `gondal_orders` order by `fulfilled_at` desc, `ordered_on` desc
---
    public function payments(Request $request)
    {
        $tab = $this->resolveModuleTab($request, 'payments', 'overview');
        $selectedStatus = (string) $request->query('status', '');
        $batchesQuery = PaymentBatch::query()
            ->when($selectedStatus !== '', fn ($query) => $query->where('status', $selectedStatus));
        $this->programScopeService->scopedPaymentBatchesQuery($batchesQuery, $request->user());
        $batches = $batchesQuery
            ->orderByDesc('period_end')
            ->get();

        $settlementRunsQuery = SettlementRun::query()->with('farmer');
        $this->programScopeService->scopedSettlementRunsQuery($settlementRunsQuery, $request->user());
        $settlementRuns = $settlementRunsQuery
            ->orderByDesc('period_end')
            ->take(25)
            ->get();

        $creditsQuery = InventoryCredit::query()
            ->with('item')
            ->when($selectedStatus !== '', fn ($query) => $query->where('status', $selectedStatus));
        $this->programScopeService->scopedInventoryCreditsQuery($creditsQuery, $request->user());
        $credits = $creditsQuery
            ->orderByDesc('credit_date')
            ->get();

        $ordersQuery = GondalOrder::query()
            ->with(['farmer', 'items.item'])
            ->when($selectedStatus !== '', fn ($query) => $query->where('status', $selectedStatus));
        $this->programScopeService->scopedOrdersQuery($ordersQuery, $request->user());
        $orders = $ordersQuery
            ->orderByDesc('fulfilled_at')
            ->orderByDesc('ordered_on')
            ->get();

select * from `venders` order by `name` asc
---
            'batches' => $batches,
            'settlementRuns' => $settlementRuns,
            'reconciliationRows' => $reconciliationRows,
            'farmers' => $this->programScopeService->scopedFarmersQuery(Vender::query(), $request->user())->orderBy('name')->get(),

select * from `gondal_payment_batches` where `gondal_payment_batches`.`id` = '72' limit 1
update `gondal_payment_batches` set `status` = 'completed', `gondal_payment_batches`.`updated_at` = '2026-04-06 15:02:35' where `id` = 72
---
    public function processPaymentBatch(string $id, Request $request): RedirectResponse
    {
        $this->requireModulePermission($request, 'payments', 'batches', 'edit');

        $batch = PaymentBatch::query()->findOrFail($id);

        if ($batch->status !== 'approved') {
            return back()->with('error', __('Only approved batches can be processed.'));
        }

        // Simulate payment gateway processing
        $batch->update(['status' => 'completed']);

select * from `gondal_warehouse_stocks` where `warehouse_id` in (1) order by `quantity` desc
select * from `gondal_one_stop_shops` where `created_by` = 2 order by `name` asc
---
            ->where('created_by', $creatorId)
            ->orderBy('name')
            ->get();
        $warehouseStocks = WarehouseStock::query()
            ->with(['warehouse', 'item'])
            ->whereIn('warehouse_id', $warehouses->pluck('id'))
            ->orderByDesc('quantity')
            ->get();
        $oneStopShops = OneStopShop::query()
            ->with(['warehouse', 'community'])
            ->where('created_by', $creatorId)
            ->orderBy('name')
            ->get();

select * from `users` where (`id` = 2 or `created_by` = 2) and `type` not in ('client', 'company', 'super admin') order by `name` asc
select * from `users` where (`id` = 2 or `created_by` = 2) and `type` = 'client' order by `name` asc
---
            return $vender;
        });

        $internalUsers = User::query()
            ->where(function ($query) use ($creatorId) {
                $query->where('id', $creatorId)
                    ->orWhere('created_by', $creatorId);
            })
            ->whereNotIn('type', ['client', 'company', 'super admin'])
            ->orderBy('name')
            ->get();

        $independentAgentUsers = User::query()
            ->where(function ($query) use ($creatorId) {
                $query->where('id', $creatorId)
                    ->orWhere('created_by', $creatorId);
            })
            ->where('type', 'client')
            ->orderBy('name')
            ->get();

        $independentAgentUsers = User::query()
            ->where(function ($query) use ($creatorId) {
                $query->where('id', $creatorId)
                    ->orWhere('created_by', $creatorId);
            })
            ->where('type', 'client')
            ->orderBy('name')
            ->get();

insert into `gondal_audit_logs` (`user_id`, `module`, `action`, `context`, `updated_at`, `created_at`) values (2, 'inventory', 'sale_recorded', '{\"sale_id\":94,\"inventory_item_id\":\"2\",\"quantity\":1}', '2026-04-06 14:52:07', '2026-04-06 14:52:07')
---
    protected function writeAuditLog(Request $request, string $module, string $action, array $context = []): void
    {
        AuditLog::query()->create([
            'user_id' => $request->user()?->id,
            'module' => $module,
            'action' => $action,
            'context' => $context,
        ]);

select * from `gondal_agent_profiles` where `user_id` = 2 and `status` = 'active' limit 1
---
    protected function currentUserAgentProfile(?User $user): ?AgentProfile
    {
        if (! $user) {
            return null;
        }

        return AgentProfile::query()
            ->with(['communityRecord', 'oneStopShop'])
            ->where('user_id', $user->id)
            ->where('status', 'active')
            ->first();