app/Http/Controllers/SystemController.php

select `value`, `name` from `settings` where `created_by` = 2
---
            $noclangName = Language::languageData($noclang);

            $setting = Utility::settingsById(\Auth::user()->id);
            $comSetting = DB::table('settings')->where('created_by', '=', \Auth::user()->id)->pluck('value', 'name')->toArray();