app/Http/Controllers/VenderController.php

    public function index(Request $request)
    {
        if(\Auth::user()->can('manage vender'))
        {
            $query = Vender::where('created_by', \Auth::user()->creatorId());

            if (!empty($request->gender)) {
                $query->where('gender', $request->gender);
            }
            if (!empty($request->status)) {
                $query->where('status', $request->status);
            }
            if (!empty($request->cooperative_id)) {
                $query->where('cooperative_id', $request->cooperative_id);
            }
            if (!empty($request->registration_date)) {
                $date_range = explode(' to ', $request->registration_date);
                if (count($date_range) == 2) {
                    $query->whereBetween('registration_date', [$date_range[0], $date_range[1]]);
                }
            }

            $venders = $query->get();
            $cooperatives = \Modules\Cooperatives\Models\Cooperative::pluck('name', 'id')->toArray();
---
select * from `venders` where `created_by` = 2
select `name`, `id` from `cooperatives`

    public function create()
    {
        if(\Auth::user()->can('create vender'))
        {
            $customFields = CustomField::where('created_by', '=', \Auth::user()->creatorId())->where('module', '=', 'vendor')->get();
            $cooperatives = \Modules\Cooperatives\Models\Cooperative::pluck('name', 'id')->toArray();
---
select * from `custom_fields` where `created_by` = 2 and `module` = 'vendor'
select `name`, `id` from `cooperatives`

    public function show($ids)
    {
        try {
            $id       = Crypt::decrypt($ids);
        } catch (\Throwable $th) {
            return redirect()->back()->with('error', __('Vendor Not Found.'));
        }

        $id     = \Crypt::decrypt($ids);
        $vendor = Vender::with(['cooperative', 'communityRecord'])->find($id);
        if (!$vendor) {
            return redirect()->back()->with('error', __('Vendor Not Found.'));
        }

        $vendor->customField = CustomField::getShowData($vendor, 'vendor');

        // Analytics
        $milkStats = $vendor->milkCollections()
            ->where('status', 'validated')
            ->selectRaw('SUM(quantity) as total_liters, AVG(fat_percentage) as avg_fat, AVG(snf_percentage) as avg_snf, SUM(total_price) as total_earnings')
            ->first();

        $outstandingLoans = InventoryCredit::where('vender_id', $vendor->id)
            ->where('status', 'pending')
            ->sum('outstanding_amount');
---
select * from `cooperatives` where `cooperatives`.`id` in (1)
select * from `venders` where `venders`.`id` = 1 limit 1
select sum(`outstanding_amount`) as aggregate from `gondal_inventory_credits` where `vender_id` = 1 and `status` = 'pending'

            'data' => $recentCollections->reverse()->pluck('quantity')->values(),
        ];

        $recentTransactions = Transaction::where('user_id', $vendor->id)
            ->where('user_type', 'Vender')
            ->orderByDesc('date')
            ->take(10)
            ->get();

        $recentBills = $vendor->bills()
            ->orderByDesc('bill_date')
            ->take(10)
            ->get();
---
select * from `transactions` where `user_id` = 1 and `user_type` = 'Vender' order by `date` desc limit 10
select * from `bills` where `bills`.`vender_id` = 1 and `bills`.`vender_id` is not null order by `bill_date` desc limit 10