app/Services/Gondal/BusinessRuleService.php

select `rule_value` from `gondal_business_rules` where `scope_type` = 'global' and `scope_id` = 0 and `rule_key` = 'inventory.credit_payment_methods' limit 1
---
    public function getRuleValue(string $key, array $default = [], ?int $projectId = null): array
    {
        if ($projectId !== null) {
            $scopedRule = BusinessRule::query()
                ->where('scope_type', 'project')
                ->where('scope_id', $projectId)
                ->where('rule_key', $key)
                ->value('rule_value');

            if (is_array($scopedRule)) {
                return $scopedRule;
            }
        }

        $globalRule = BusinessRule::query()
            ->where('scope_type', 'global')
            ->where('scope_id', 0)
            ->where('rule_key', $key)
            ->value('rule_value');