app/Services/Gondal/InventoryWorkflowService.php

select sum(`quantity_issued`) as aggregate from `gondal_stock_issues` where `agent_profile_id` = 1 and `inventory_item_id` = 2 and `issue_stage` = 'oss_to_agent' and date(`issued_on`) <= '2026-04-06'
select sum(`quantity`) as aggregate from `gondal_inventory_sales` where `agent_profile_id` = 1 and `inventory_item_id` = 2 and `cancelled_at` is null and date(`sold_on`) <= '2026-04-06'
select sum(`quantity_delta`) as aggregate from `gondal_agent_inventory_adjustments` where `agent_profile_id` = 1 and `inventory_item_id` = 2 and date(`effective_on`) <= '2026-04-06'
---
    public function availableAgentItemStock(int $agentProfileId, int $inventoryItemId, ?Carbon $asOf = null): float
    {
        $issueQuery = StockIssue::query()
            ->where('agent_profile_id', $agentProfileId)
            ->where('inventory_item_id', $inventoryItemId)
            ->where('issue_stage', 'oss_to_agent');
        $salesQuery = InventorySale::query()
            ->where('agent_profile_id', $agentProfileId)
            ->where('inventory_item_id', $inventoryItemId)
            ->whereNull('cancelled_at');
        $adjustmentQuery = AgentInventoryAdjustment::query()
            ->where('agent_profile_id', $agentProfileId)
            ->where('inventory_item_id', $inventoryItemId);

        if ($asOf) {
            $issueQuery->whereDate('issued_on', '<=', $asOf->toDateString());
            $salesQuery->whereDate('sold_on', '<=', $asOf->toDateString());
            $adjustmentQuery->whereDate('effective_on', '<=', $asOf->toDateString());
        }

        return max(
            (float) $issueQuery->sum('quantity_issued')
            - (float) $salesQuery->sum('quantity')
            + (float) $adjustmentQuery->sum('quantity_delta'),
            0
        );

select * from `venders` where `venders`.`id` = '1' limit 1
select * from `gondal_inventory_items` where `gondal_inventory_items`.`id` = '2' limit 1
select * from `gondal_agent_profiles` where `gondal_agent_profiles`.`id` = '1' limit 1
---
    public function createInventorySale(array $payload): InventorySale
    {
        if ($payload['vender_id'] ?? null) {
            $vender = Vender::query()->find($payload['vender_id']);
            $payload['customer_name'] = $vender ? $vender->name : ($payload['customer_name'] ?? null);
        }

        return DB::transaction(function () use ($payload): InventorySale {
            $item = InventoryItem::query()->findOrFail($payload['inventory_item_id']);
            $agentProfile = ! empty($payload['agent_profile_id'])
                ? AgentProfile::query()->findOrFail($payload['agent_profile_id'])
                : null;
            $vender = ! empty($payload['vender_id'])
                ? Vender::query()->findOrFail($payload['vender_id'])

select sum(CASE WHEN outstanding_amount > 0 THEN outstanding_amount ELSE amount END) as aggregate from `gondal_inventory_credits` where `agent_profile_id` = 1 and `status` in ('open', 'partial')
---

            $totalAmount = round((float) $payload['quantity'] * (float) $payload['unit_price'], 2);
            if (in_array(($payload['payment_method'] ?? null), $creditPaymentMethods, true) && $agentProfile) {
                $currentExposure = (float) InventoryCredit::query()
                    ->where('agent_profile_id', $agentProfile->id)
                    ->whereIn('status', ['open', 'partial'])
                    ->sum(DB::raw('CASE WHEN outstanding_amount > 0 THEN outstanding_amount ELSE amount END'));

insert into `gondal_inventory_sales` (`inventory_item_id`, `batch_id`, `agent_profile_id`, `order_id`, `project_id`, `extension_visit_id`, `vender_id`, `quantity`, `unit_price`, `total_amount`, `payment_method`, `credit_allowed_snapshot`, `sold_on`, `customer_name`, `updated_at`, `created_at`) values ('2', '', '1', '', '', '', '1', '1', '2500', 2500, 'Milk Collection Balance', 1, '2026-04-06 00:00:00', 'usman Ahmed', '2026-04-06 14:52:07', '2026-04-06 14:52:07')
---
                }
            }

            $sale = InventorySale::query()->create([
                'inventory_item_id' => $payload['inventory_item_id'],
                'batch_id' => $payload['batch_id'] ?? null,
                'agent_profile_id' => $payload['agent_profile_id'] ?? null,
                'order_id' => $payload['order_id'] ?? null,
                'project_id' => $projectId,
                'extension_visit_id' => $payload['extension_visit_id'] ?? null,
                'vender_id' => $payload['vender_id'] ?? null,
                'quantity' => $payload['quantity'],
                'unit_price' => $payload['unit_price'],
                'total_amount' => $totalAmount,
                'payment_method' => $payload['payment_method'],
                'credit_allowed_snapshot' => $agentProfile?->credit_sales_enabled ?? false,
                'sold_on' => $payload['sold_on'],
                'customer_name' => $payload['customer_name'] ?? null,
            ]);

insert into `gondal_inventory_credits` (`inventory_item_id`, `agent_profile_id`, `order_id`, `project_id`, `inventory_sale_id`, `vender_id`, `customer_name`, `amount`, `outstanding_amount`, `status`, `credit_date`, `due_date`, `updated_at`, `created_at`) values (2, '1', '', '', 94, '1', 'usman Ahmed', 2500, 2500, 'open', '2026-04-06 00:00:00', '2026-04-20 00:00:00', '2026-04-06 14:52:07', '2026-04-06 14:52:07')
---
            $isCreditGenerating = in_array(($payload['payment_method'] ?? null), $creditPaymentMethods, true) || ($payload['payment_method'] ?? null) === 'Mixed';

            if ($isCreditGenerating && $creditAmount > 0) {
                $credit = InventoryCredit::query()->create([
                    'inventory_item_id' => $item->id,
                    'agent_profile_id' => $payload['agent_profile_id'] ?? null,
                    'order_id' => $payload['order_id'] ?? null,
                    'project_id' => $projectId,
                    'inventory_sale_id' => $sale->id,
                    'vender_id' => $payload['vender_id'] ?? null,
                    'customer_name' => $payload['customer_name'] ?? 'Unknown Customer',
                    'amount' => $creditAmount,
                    'outstanding_amount' => $creditAmount,
                    'status' => 'open',
                    'credit_date' => $payload['sold_on'],
                    'due_date' => $payload['due_date'] ?? Carbon::parse($payload['sold_on'])->addDays($creditObligationDefaults['due_days'])->toDateString(),
                ]);