app/Services/Gondal/LedgerService.php

    public function postMilkCollectionValue(MilkCollection $collection, ?float $unitPrice = null, ?User $actor = null, ?Project $project = null): JournalEntry
    {
        $farmer = $collection->farmer ?: Vender::find($collection->farmer_id);
---
select * from `venders` where `venders`.`id` = 1 limit 1

    public function postInventorySale(InventorySale $sale, ?User $actor = null): JournalEntry
    {
        $farmer = $sale->vender ?: Vender::find($sale->vender_id);
---
select * from `venders` where `venders`.`id` = '1' limit 1

    public function farmerAccountBalance(Vender $farmer, ?int $adminId = null): float
    {
        $adminId = $adminId ?? ($farmer->created_by ?: (\Auth::check() ? (\Auth::user()->creatorId() ?: \Auth::user()->id) : null));
        $accounts = $this->ensureDefaultAccounts($adminId);

        $payableId = $accounts['farmer_payable']->id;
        $obligationId = $accounts['farmer_obligation']->id;

        $lines = JournalLine::query()
            ->where('farmer_id', $farmer->id)
            ->whereIn('finance_account_id', [$payableId, $obligationId])
            ->get();
---
select * from `gondal_journal_lines` where `farmer_id` = 1 and `finance_account_id` in (949, 950)

    public function syncFarmerPayableBalance(int $farmerId): void
    {
        $farmer = Vender::find($farmerId);
        if (!$farmer) {
            return;
        }

        $balance = $this->farmerAccountBalance($farmer, $farmer->created_by);
        $farmer->update(['balance' => $balance]);
---
select * from `venders` where `venders`.`id` = 1 limit 1
update `venders` set `balance` = 2500, `venders`.`updated_at` = '2026-04-06 14:52:07' where `id` = 1

    protected function postEntry(array $payload): JournalEntry
    {
        return DB::transaction(function () use ($payload): JournalEntry {
            $entryType = $payload['entry_type'] ?? 'legacy';
            $sourceKey = $payload['source_key'] ?? null;

            if ($sourceKey) {
                $existing = JournalEntry::query()
                    ->where('entry_type', $entryType)
                    ->where('source_key', $sourceKey)
                    ->whereNull('reversal_of_entry_id')
                    ->where('status', 'posted')
                    ->first();

                if ($existing) {
                    return $existing->load('lines');
                }
            }

            if (count($payload['lines']) < 2) {
                throw new \InvalidArgumentException('Journal entries require at least two lines.');
            }

---
select * from `gondal_journal_entries` where `entry_type` = 'milk_accrual' and `source_key` = 'milk_collection:191' and `reversal_of_entry_id` is null and `status` = 'posted' limit 1
select * from `gondal_journal_entries` where `entry_type` = 'inventory_sale' and `source_key` = 'inventory_sale:94' and `reversal_of_entry_id` is null and `status` = 'posted' limit 1

                throw new \InvalidArgumentException('Journal entries must balance with positive debit and credit totals.');
            }

            $entry = JournalEntry::query()->create([
                'entry_number' => $this->nextReference('JRN'),
                'entry_date' => $payload['entry_date'],
                'entry_type' => $entryType,
                'reference_type' => $payload['reference_type'] ?? null,
                'reference_id' => $payload['reference_id'] ?? null,
                'source_key' => $sourceKey,
                'description' => $payload['description'] ?? null,
                'status' => $payload['status'] ?? 'posted',
                'reversal_of_entry_id' => $payload['reversal_of_entry_id'] ?? null,
                'created_by' => $payload['created_by'] ?? null,
                'posted_by' => $payload['posted_by'] ?? null,
                'meta' => $payload['meta'] ?? null,
            ]);
---
insert into `gondal_journal_entries` (`entry_number`, `entry_date`, `entry_type`, `reference_type`, `reference_id`, `source_key`, `description`, `status`, `reversal_of_entry_id`, `created_by`, `posted_by`, `meta`, `updated_at`, `created_at`) values ('JRN-20260406145207-PSDR', '2026-04-06 00:00:00', 'inventory_sale', 'App\Models\Gondal\InventorySale', 94, 'inventory_sale:94', 'Inventory sale recorded for farmer #1', 'posted', '', '', '', '{\"inventory_item_id\":\"2\",\"quantity\":1,\"unit_price\":2500}', '2026-04-06 14:52:07', '2026-04-06 14:52:07')

    protected function firstOrCreateAccount(?int $createdBy, string $code, string $name, string $type): FinanceAccount
    {
        return FinanceAccount::query()->firstOrCreate(
            [
                'code' => $code,
                'created_by' => $createdBy,
            ],
            [
                'name' => $name,
                'type' => $type,
                'is_system' => true,
            ],
        );
---
select * from `gondal_finance_accounts` where (`code` = 'GL-MILK-EXP' and `created_by` = 2) limit 1