app/Services/Gondal/MilkCollectionWorkflowService.php

insert into `milk_collections` (`batch_id`, `mcc_id`, `milk_collection_center_id`, `farmer_id`, `cooperative_id`, `project_id`, `quantity`, `fat_percentage`, `snf_percentage`, `temperature`, `quality_grade`, `rejection_reason`, `adulteration_test`, `recorded_by`, `photo_path`, `collection_date`, `unit_price`, `total_price`, `updated_at`, `created_at`) values ('WEB-20260406112009', 'Yola center 12', 2, 1, 1, '', '1000', '4.20', '', '18.5', 'A', '', 'passed', 2, '', '2026-04-06 11:19:00', 100, 100000, '2026-04-06 11:20:09', '2026-04-06 11:20:09')
insert into `gondal_milk_quality_tests` (`milk_collection_id`, `milk_collection_center_id`, `farmer_id`, `project_id`, `tested_by`, `fat_percentage`, `snf_percentage`, `temperature`, `adulteration_test`, `quality_grade`, `is_rejected`, `rejection_reason`, `tested_at`, `meta`, `updated_at`, `created_at`) values (182, 2, 1, '', 2, '4.20', '', '18.5', 'passed', 'A', 0, '', '2026-04-06 11:19:00', '{\"captured_via\":\"milkcollection_web\"}', '2026-04-06 11:20:09', '2026-04-06 11:20:09')
select * from `gondal_milk_quality_tests` where (`milk_collection_id` = 182) limit 1
---
            $attributes['total_price'] = round((float) $payload['quantity'] * $unitPrice, 2);

            $collection = array_key_exists('quality_grade', $payload)
                ? MilkCollection::withoutEvents(fn () => MilkCollection::query()->create($attributes))
                : MilkCollection::query()->create($attributes);

            MilkQualityTest::query()->updateOrCreate(
                ['milk_collection_id' => $collection->id],
                [
                    'milk_collection_center_id' => $collection->milk_collection_center_id,
                    'farmer_id' => $collection->farmer_id,
                    'project_id' => $collection->project_id,
                    'tested_by' => $actor->id,
                    'fat_percentage' => $collection->fat_percentage,
                    'snf_percentage' => $collection->snf_percentage,
                    'temperature' => $collection->temperature,
                    'adulteration_test' => $collection->adulteration_test ?: 'passed',
                    'quality_grade' => $collection->quality_grade,
                    'is_rejected' => strtoupper((string) $collection->quality_grade) === 'C',
                    'rejection_reason' => $collection->rejection_reason,
                    'tested_at' => $collection->collection_date,
                    'meta' => [
                        'captured_via' => $payload['captured_via'] ?? 'web',
                    ],
                ],
            );

update `milk_collections` set `unit_price` = 100, `total_price` = 5000, `milk_collections`.`updated_at` = '2026-04-06 14:56:00' where `id` = 197
select * from `gondal_milk_quality_tests` where (`milk_collection_id` = 197) limit 1
---
    public function validateCollection(MilkCollection $collection, array $payload, User $actor): MilkCollection
    {
        return DB::transaction(function () use ($actor, $collection, $payload): MilkCollection {
            $collection->update([
                'fat_percentage' => $payload['fat_percentage'] ?? $collection->fat_percentage,
                'snf_percentage' => $payload['snf_percentage'] ?? $collection->snf_percentage,
                'temperature' => $payload['temperature'] ?? $collection->temperature,
                'adulteration_test' => $payload['adulteration_test'] ?? ($collection->adulteration_test ?: 'passed'),
                'quality_grade' => $payload['quality_grade'],
                'rejection_reason' => $payload['rejection_reason'] ?? null,
                'status' => strtoupper((string) $payload['quality_grade']) === 'C' ? 'rejected' : 'validated',
                'validated_by' => $actor->id,
                'validated_at' => now(),
            ]);

            // Now resolve the price based on the final grade assigned by supervisor
            $unitPrice = $this->ledgerService->resolveMilkPrice($collection);
            $collection->update([
                'unit_price' => $unitPrice,
                'total_price' => round((float) $collection->quantity * $unitPrice, 2),
            ]);

            // Sync the quality test record
            MilkQualityTest::query()->updateOrCreate(
                ['milk_collection_id' => $collection->id],
                [
                    'tested_by' => $actor->id,
                    'fat_percentage' => $collection->fat_percentage,
                    'snf_percentage' => $collection->snf_percentage,
                    'temperature' => $collection->temperature,
                    'adulteration_test' => $collection->adulteration_test,
                    'quality_grade' => $collection->quality_grade,
                    'is_rejected' => $collection->status === 'rejected',
                    'rejection_reason' => $collection->rejection_reason,
                    'tested_at' => now(),
                ]
            );

select * from `milk_collections` where `milk_collection_center_id` = 2 and date(`collection_date`) = '2026-04-06' and `project_id` is null
select sum(`amount`) as aggregate from `gondal_journal_lines` where `farmer_id` in (1) and exists (select * from `gondal_finance_accounts` where `gondal_journal_lines`.`finance_account_id` = `gondal_finance_accounts`.`id` and `code` = 'GL-FARMER-PAY') and `direction` = 'credit' and date(`created_at`) = '2026-04-06'
---
    public function syncDailyReconciliation(MilkCollection $collection, ?User $actor = null): MilkCollectionReconciliation
    {
        $reconciliationDate = optional($collection->collection_date)->toDateString() ?: now()->toDateString();
        $query = MilkCollection::query()
            ->where('milk_collection_center_id', $collection->milk_collection_center_id)
            ->whereDate('collection_date', $reconciliationDate);

        if ($collection->project_id) {
            $query->where('project_id', $collection->project_id);
        } else {
            $query->whereNull('project_id');
        }

        $collections = $query->get();
        $accepted = $collections->filter(fn (MilkCollection $item) => strtoupper((string) $item->quality_grade) !== 'C');
        $rejected = $collections->filter(fn (MilkCollection $item) => strtoupper((string) $item->quality_grade) === 'C');
        $latestCollection = $collections->sortByDesc('collection_date')->first();

        $acceptedValue = round((float) $accepted->sum(fn (MilkCollection $item) => (float) $item->quantity * $this->ledgerService->resolveMilkPrice($item)), 2);

        $ledgerValue = round((float) \App\Models\Gondal\JournalLine::query()
            ->whereIn('farmer_id', $collections->pluck('farmer_id')->filter()->unique())
            ->whereHas('account', fn ($q) => $q->where('code', 'GL-FARMER-PAY'))
            ->where('direction', 'credit')
            ->whereDate('created_at', $reconciliationDate)
            ->sum('amount'), 2);