app/Models/Language.php

    public static function languageData($code)
    {
        $cacheKey = 'language_data_' . $code;

        return cache()->remember($cacheKey, now()->addHours(24), function () use ($code) {
            return Language::where('code', $code)->first() ?? new Language([
                'code' => $code,
                'full_name' => ucwords(str_replace('-', ' ', $code)),
            ]);
---
select * from `languages` where `code` = 'en' limit 1