app/Models/Vender.php

select * from `bills` where `vender_id` = 1 order by `bill_date` desc
---
    public function vendorBill($vendorId)
    {
        $bills = Bill::where('vender_id', $vendorId)->orderBy('bill_date', 'desc')->get();

select * from `bills` where `vender_id` = 1 and `status` not in ('0', '4') and `due_date` < '2026-04-06'
---
    public function vendorOverdue($vendorId)
    {
        $dueBill = Bill::where('vender_id', $vendorId)->whereNotIn('status', ['0', '4'])
            ->where('due_date', '<', date('Y-m-d'))->get();

select * from `bills` where `bills`.`vender_id` = 1 and `bills`.`vender_id` is not null
---
    public function vendorTotalBillSum($vendorId)
    {
        return $this->bills()
            ->with(['items']) // Eager load the items relationship to avoid N+1 problem
            ->get()
            ->sum->getTotal();

select count(*) as aggregate from `bills` where `vender_id` = 1
---
    public function vendorTotalBill($vendorId)
    {
        $bills = Bill::where('vender_id', $vendorId)->count();