Modules/MilkCollection/app/Http/Controllers/MilkCollectionController.php

    public function index(Request $request)
    {
        if (\Auth::user()->can('manage vender')) { // Using vender permission as generic access config
            $query = \Modules\MilkCollection\Models\MilkCollection::with(['farmer', 'recorder']);

            // Filters
            if (!empty($request->mcc_id)) {
                $query->where('mcc_id', $request->mcc_id);
            }
            if (!empty($request->farmer_id)) {
                $query->where('farmer_id', $request->farmer_id);
            }
            if (!empty($request->quality_grade)) {
                $query->where('quality_grade', $request->quality_grade);
            }
            if (!empty($request->start_date) && !empty($request->end_date)) {
                $query->whereBetween('collection_date', [$request->start_date . ' 00:00:00', $request->end_date . ' 23:59:59']);
            }

            $collections = $query->orderBy('collection_date', 'desc')->get();
---
select * from `milk_collections` order by `collection_date` desc

            $farmers = \App\Models\Vender::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $farmers->prepend('All Farmers', '');

            $mccs = \Modules\MilkCollection\Models\MilkCollectionCenter::where('created_by', \Auth::user()->creatorId())
                ->pluck('name', 'name')->toArray();
---
select `name` from `milk_collection_centers` where `created_by` = 2

    public function create()
    {
        if (\Auth::user()->can('manage vender')) {
            $farmers = \App\Models\Vender::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $farmers->prepend('Select Farmer', '');

            // Quick entry logic: Get last 10 farmers this user recorded
            $recentFarmersIds = \Modules\MilkCollection\Models\MilkCollection::where('recorded_by', \Auth::user()->id)
                                ->orderBy('id', 'desc')
                                ->take(10)
                                ->pluck('farmer_id')
                                ->unique()
                                ->toArray();
            $recentFarmers = \App\Models\Vender::whereIn('id', $recentFarmersIds)->get()->pluck('name', 'id');

            $mccs = \Modules\MilkCollection\Models\MilkCollectionCenter::where('created_by', \Auth::user()->creatorId())
                ->pluck('name', 'name')->toArray();
---
select `farmer_id` from `milk_collections` where `recorded_by` = 2 order by `id` desc limit 10
select `name` from `milk_collection_centers` where `created_by` = 2

    public function store(Request $request)
    {
        if (\Auth::user()->can('manage vender')) {
            $validator = \Validator::make(
                $request->all(), [
                    'mcc_id' => 'required',
                    'farmer_id' => 'required',
                    'quantity' => 'required|numeric|min:0.01',
                    'collection_date' => 'required|date',
                ]
            );

            if ($validator->fails()) {
                $messages = $validator->getMessageBag();
                return redirect()->back()->with('error', $messages->first());
            }

            $farmer = \App\Models\Vender::query()->with('cooperative')->findOrFail($request->farmer_id);
---
select * from `cooperatives` where `cooperatives`.`id` in (1)
select * from `venders` where `venders`.`id` = '1' limit 1